# Obtaining Our Data - Lab

## Introduction
In this lab you'll practice your munging and transforming skills in order to load in your data to solve a regression problem.

## Objectives
You will be able to:
* Understand the ETL process and the steps it consists of
* Understand the challenges of working with data from multiple sources

## Task Description

Your boss gives you a general description of some of the datasets at your disposal for analyzing weekly store sales. They're eventually looking for you to build a model to help determine what factors impact sales, and model future sales forecasting for business planning.  
  
Most of the properietary store data sits in the company sql database, accessible by all managers and above. The database is called **Walmart.db** Your boss provides you with the following basic schema:  

<img src='db_schema.jpg' width=500>  

She then tells you that she's put together a second dataset on general economy statistics for the various dates that she would also like you to incorporate in your analysis. That data, she says, is stored in a file **economy_data.csv**.

As a first step in creating your model for providing recommendations and projections, load and synthesize these disperate datasets into a singular unified DataFrame. Then save your results to a file **Merged_Store_Data.csv**.

Make sure you check the various data types and merge appropriately.

In [1]:
# import statements
import sqlite3
import pandas as pd

In [2]:
#Create a connection
con = sqlite3.connect('Walmart.db')
#Create a cursor
cur = con.cursor()
#Select some data
# cur.execute("""""")
# df = pd.DataFrame(cur.fetchall())
# df.columns = [i[0] for i in cur.description]
# print(df.shape)
# df.head()

In [3]:
def sql_select_to_df(SQL_COMMAND, cur=cur):
    results = cur.execute(SQL_COMMAND).fetchall()
    df = pd.DataFrame(results)
    df.columns = [i[0] for i in cur.description]
    return df

In [21]:
sql_select_to_df("""SELECT * FROM sales;""").head(25)

    Store  Dept        Date  Weekly_Sales IsHoliday
0       1     1  2010-02-05      24924.50     False
1       1     1  2010-02-12      46039.49      True
2       1     1  2010-02-19      41595.55     False
3       1     1  2010-02-26      19403.54     False
4       1     1  2010-03-05      21827.90     False
5       1     1  2010-03-12      21043.39     False
6       1     1  2010-03-19      22136.64     False
7       1     1  2010-03-26      26229.21     False
8       1     1  2010-04-02      57258.43     False
9       1     1  2010-04-09      42960.91     False
10      1     1  2010-04-16      17596.96     False
11      1     1  2010-04-23      16145.35     False
12      1     1  2010-04-30      16555.11     False
13      1     1  2010-05-07      17413.94     False
14      1     1  2010-05-14      18926.74     False
15      1     1  2010-05-21      14773.04     False
16      1     1  2010-05-28      15580.43     False
17      1     1  2010-06-04      17558.09     False
18      1     1  2010-06-11      16637.62     False
19      1     1  2010-06-18      16216.27     False
20      1     1  2010-06-25      16328.72     False
21      1     1  2010-07-02      16333.14     False
22      1     1  2010-07-09      17688.76     False
23      1     1  2010-07-16      17150.84     False
24      1     1  2010-07-23      15360.45     False

In [5]:
#merge walmart db
walmart_df = sql_select_to_df("""SELECT * FROM sales 
                            JOIN store_details
                            using('Store')""")

In [39]:
walmart_df.sort_values(['Date','Store']).head()

     Store  Dept        Date  Weekly_Sales IsHoliday Type    Size
0        1     1  2010-02-05      24924.50     False    A  151315
143      1     2  2010-02-05      50605.27     False    A  151315
286      1     3  2010-02-05      13740.12     False    A  151315
429      1     4  2010-02-05      39954.04     False    A  151315
572      1     5  2010-02-05      32229.38     False    A  151315

In [6]:
#import csv
economy_df = pd.read_csv('economy_data.csv')

In [35]:
economy_df.head()

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,2010-02-05,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,2010-02-12,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,2010-02-19,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,2010-02-26,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,2010-03-05,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False

In [8]:
msd = walmart_df.copy()

In [27]:
msd = pd.merge(walmart_df,economy_df,on=['Store','Date'])

In [40]:
msd.head()

,Store,Dept,Date,Weekly_Sales,IsHoliday_x,Type,Size,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday_y
0,1,1,2010-02-05,24924.50,False,A,151315,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,2,2010-02-05,50605.27,False,A,151315,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
2,1,3,2010-02-05,13740.12,False,A,151315,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
3,1,4,2010-02-05,39954.04,False,A,151315,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
4,1,5,2010-02-05,32229.38,False,A,151315,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False

## Summary
Nice work! You're working more and more independently through the workflow, and ensuring data integrity!